app/Controllers/BlogController.php

    public function index()
    {
        $data = [];
         $data['passLink'] = "blog";
        $data['userData'] = session()->get('userData');

        $BlogModel = new BlogModel();
        $data['all_blogs'] = $BlogModel->findAll();

        $CategoryModel = new CategoryModel();
        $data['all_categories'] = $CategoryModel->findAll();
---
SELECT *
FROM `blog`
SELECT *
FROM `categories`

    public function edit($id)
    {
         if(empty($id) || !is_numeric($id))
         {
            return redirect()->to('/dashboard/blog')->with('error', 'Unknown Error');
            exit();
         }

        $data = [];
         $data['passLink'] = "blog";
        $data['userData'] = session()->get('userData');

        $BlogModel = new BlogModel();
        $data['blog_data'] = $BlogModel->find($id);

        if(empty($data['blog_data'])){
        return redirect()->to('/dashboard/blog')->with('error', 'Unknown Error');
        exit();

      }

        $CategoryModel = new CategoryModel();
        $data['all_categories'] = $CategoryModel->findAll();
---
SELECT *
FROM `blog`
WHERE `blog`.`id` = '5'
SELECT *
FROM `categories`