app/Controllers/CoursesController.php

SELECT *
FROM `categories`
SELECT *
FROM `staff`
---
    public function index()
    {
        $data = [];
         $data['passLink'] = "courses";
        $data['userData'] = session()->get('userData');

        $CoursesModel = new CoursesModel();
        $data['aall_courses'] = $CoursesModel->findAll();

        $CategoryModel = new CategoryModel();
        $data['all_categories'] = $CategoryModel->findAll();

        $StaffModel = new StaffModel();
        $data['all_staff'] = $StaffModel->findAll();