app/Controllers/Dashboard.php

    public function index(){

         $data['passLink'] = "dashboard";
         $data['userData'] = session()->get('userData');


         $TeamModel = new TeamModel();
		$BlogModel = new BlogModel();
		$CoursesModel = new CoursesModel();
		$StaffModel = new StaffModel();

		$data['total_team'] = $TeamModel->findAll();
		$data['total_blogPost'] = $BlogModel->findAll();
		$data['total_courses'] = $CoursesModel->findAll();
		$data['total_staff'] = $StaffModel->findAll();
---
SELECT *
FROM `team`
SELECT *
FROM `blog`
SELECT *
FROM `staff`