app/Controllers/Publiccontroller.php

    public function index(){
        $data = [];


        $BlogModel = new BlogModel();
        $TestimonialsModel = new TestimonialsModel();
        $CoursesModel = new CoursesModel();

        $data['latest_blog_post'] = $BlogModel->recent_blogs();
        $data['testimonials_rescent'] = $TestimonialsModel->orderBy('id', 'desc')->limit(10)->get()->getResult();
---
SELECT *
FROM `testimonials`
ORDER BY `id` DESC
 LIMIT 10