app/Controllers/StaffController.php

SELECT *
FROM `staff`
---
    public function index(){

        $data = [];

        $data['passLink'] = "staff";
        $data['userData'] = session()->get('userData');

        $StaffModel = new StaffModel();
        $data['all_staff'] = $StaffModel->findAll();