app/Controllers/TeamMemberController.php

SELECT *
FROM `team`
---
    public function index(){

        $data = [];

        $data['passLink'] = "team";
        $data['userData'] = session()->get('userData');

        $TeamModel = new TeamModel();
        $data['all_team'] = $TeamModel->findAll();