app/Controllers/TestimonialsController.php

    public function index(){

      $data = [];

      $data['passLink'] = "testimonials";
        $data['userData'] = session()->get('userData');

      $testimonialModel = new TestimonialsModel();
      $data['all_testimonials'] = $testimonialModel->findAll();
---
SELECT *
FROM `testimonials`