app/Models/BlogModel.php

 public function recent_blogs()
{
    $query = $this->db->table('blog')
        ->select('blog.*, blog.id as blg_id, team.*, COUNT(blog_comments.postId) as comment_count')
        ->join('team', 'team.id = blog.createdBy')
        ->join('blog_comments', 'blog_comments.postId = blog.id', 'left')
        ->groupBy('blog.id') // Group by the blog post id
        ->orderBy('blog.id', 'desc')
        ->limit(3)
        ->get()
        ->getResult();
---
SELECT `blog`.*, `blog`.`id` as `blg_id`, `team`.*, COUNT(blog_comments.postId) as comment_count
FROM `blog`
JOIN `team` ON `team`.`id` = `blog`.`createdBy`
LEFT JOIN `blog_comments` ON `blog_comments`.`postId` = `blog`.`id`
GROUP BY `blog`.`id`
ORDER BY `blog`.`id` DESC
 LIMIT 3